Revit 2026 API

# RebarConstraintFlipSideForClearBarSpacingZeroDistanceConstraint Method

---

Flips the side on which a RebarConstrainedHandle constrained using clear bar distance with zero offset connects to another Rebar target handle.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void FlipSideForClearBarSpacingZeroDistanceConstraint()
```
```vb
Public Sub FlipSideForClearBarSpacingZeroDistanceConstraint
```
```cpp
public:
void FlipSideForClearBarSpacingZeroDistanceConstraint()
```
```fsharp
member FlipSideForClearBarSpacingZeroDistanceConstraint : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'. -or- The RebarConstraint constrain two Rebar ends. -or- The RebarTargetConstraintType is 'HookBend' or 'BarBend'. -or- The RebarConstraint is not using clear bar distance with zero offset to the target rebar. |

This is available only for constraints of type ToOtherRebar, using clear bar distance with zero offset.

#### Reference

RebarConstraint Class

Autodesk.Revit.DB.Structure Namespace